Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/recreational_activities_in_ireland/sport_and_leisure/regulation_of_public_swimming_pools_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Regulation of public swimming pools in Ireland
ga: Rialachán Linnte Snámha Poiblí in Éirinn

source: Public swimming pools in Ireland are provided to the public and maintained by local authorities
ga: Is iad na h-údaráis áitiúla a chuireann linnte snámha poiblí ar fáil don phobal in Éirinn agus a dhéanann cothabháil orthu

source: Under the Local Government Act, 2001, the provision of recreational facilities such as swimming pools is a function of local authorities
ga: Faoin Acht um Rialtas Áitiúil, 2001, titeann an cúram ar údaráis áitiúla áiseanna áineasa ar nós linnte snámha a sholáthar

source: Although this does not compel a local authority to provide a swimming pool, in practice there is at least one public swimming pool in most local authority areas
ga: Cé nach bhfuil sé de dhualgas ar údarás áitiúil linn snámha a sholáthar mar a sheasann sé tá ar a laghad linn snámha amháin poiblí i bhformhór na gceantar údaráis áitiúla

source: The Government provides capital grants to local authorities to build and renovate public swimming pools
ga: Cuireann an Rialtas deontais chaipitiúla ar fáil do na húdaráis áitiúla le linnte snámha poiblí a thógáil agus le feabhsúcháin a dhéanamh orthu

source: The current scheme in operation is the Local Authority Swimming Pool Programme, which is managed by the Department of Transport, Tourism and Sport
ga: Is é Clár Linnte Snámha na nÚdarás Áitiúil an scéim reatha atá dhá riaradh ag An Roinn Iompair, Turasóireachta agus Spóirt, Turasóireachta agus Spóirt

source: The closing date for applications for the current programme was July 2000
ga: Ba Iúil 2000 an dáta deiridh d'iarratais don chlár reatha

source: All bathing areas in Ireland must meet the quality standards set out in Directive 2006/7/EC on Bathing Waters implemented by the Bathing Water Quality Regulations 2008 (SI 79 of 2008)
ga: Ní mór do gach ceantar snámha in Éirinn na bunchaighdeáin cháilíochta atá leagtha síos i dTreoir (2006/7/EC) an AE um Uiscí Snámha a chomhlíonadh, i bhfeidhm ag na Rialacháin um Cháilíocht Uisce Snámha 2008 (IR 79 de 2008)

source: Transitional measures are in place until the 2008 Regulations are fully implemented in 2015
ga: Tá bearta idirthréimhseacha i bhfeidhm go dtí na Rialacháin 2008 i bhfeidhm go hiomlán i 2015

source: The legislation applies to freshwater and seawater bathing areas
ga: Baineann an Treoir le ceantair snámha fíoruisce agus farraige

source: It does not include swimming pools. The Department of Housing, Planning, Community and Local Government, through the Environmental Protection Agency (EPA), is responsible for monitoring the quality of water in all public bathing water areas
ga: Tá an Roinn Chomhshaoil agus Rialtais Áitiúil, tríd an Údarás Cosanta Timpeallachta (ÚCT) freagrach as monatóireacht a dhéanamh ar cháilíocht uisce i ngach ceantar poiblí snámha

source: Swimming pools are not currently subject to any statutory quality requirements
ga: Níl aon riachtanais cháilíochta reachtúla ann faoi láthair a bhaineann le linnte snámha

source: The EPA has to ensure that all freshwater and seawater areas where citizens may swim conform to a minimum water quality standard, as set out in the directive
ga: Ní mór don ÚCT déanamh cinnte go bhfuil gach linn phoiblí agus gach ceantar fíoruisce agus farraige ina mbíonn daoine ag snámh ag cloí le bunchaighdeáin cháilíochta uisce, mar atá leagtha síos sa treoir

source: Each State is required to retest their freshwater and seawater areas at regular intervals
ga: Tá sé mar dhualgas ar gach Stát athscrúdú rialta a dhéanamh ar na ceantair fíoruisce agus farraige

source: The EPA report for 2011 indicated that 98.5% of bathing areas around Ireland were up to EU minimum standards
ga: Tuairisc an EPA don bhliain 2011 le fios go raibh 98.5% de na limistéir snámha ar fud na hÉireann suas le caighdeáin íosta an AE

source: Irish Water Safety is the statutory body that deals with water safety and swimming rescue
ga: Is é an Cumann Sábháilteacht Uisce an t-údarás reachtúil a bhíonn ag plé le sábháilteacht uisce agus tarrtháil snámha

source: The organisation is financed by a combination of Government, local authority and private funding
ga: Tá an eagraíocht dhá chomhaoiniú ag an Rialtas, ag an údarás áitiúil agus airgead príobháideach

source: Its function is to promote water safety in Ireland by providing information, running lifesaving training courses and advising local authorities
ga: Tá sé mar aidhm aici sábháilteacht uisce a chur chun cinn in Éirinn tríd eolas a sholáthar, cúrsaí traenála tarrthála a eagrú agus comhairle a chur ar údaráis áitiúla

source: Each local authority has a water safety development officer
ga: Tá oifigeach forbartha sábháilteachta uisce ag gach údarás áitiúil

source: Contact details for each water safety development officer in the country are available from Irish Water Safety
ga: Tá sonraí teagmhála do gach oifigeach forbartha sábháilteachta uisce sa tír ar fáil ón gCumann Sábháilteacht Uisce

source: Public amenities such as swimming pools are required to have fire exits and a designated place of assembly, often the car park outside, under the Fire Safety in Places of Assembly Regulations 1985
ga: Ní mór go mbeadh bealaí éalaithe tine agus áit faoi leith curtha ar leataobh mar láthair thionóil ag áiseanna poiblí, go minic bíonn an carrchlós taobh amuigh leagtha síos, faoi Rialacháin um Shábháilteacht Tine in Áiteanna Tionóil 1985

source: Anyone over 16 years of age who is a competent swimmer can join a course to become a qualified lifeguard
ga: Is féidir le duine ar bith atá ar a laghad sé bliana déag d’aois agus atá ina snámhóir maith cúrsa a dhéanamh le bheith ina g(h)arda tarrthála cáilithe

source: To work as a lifeguard in a swimming pool, you must have an Irish Water Safety Pool Lifeguard Award, which is given to people who complete the Irish Water Safety Pool Lifeguard examination and to those who complete the Lifeguarding training offered by Quality and Qualifications Ireland
ga: Bronntar an dámhachtain ar dhaoine a dhéanann scrúdú Garda Tarrthála Linn Snámha an Chumainn agus orthu siúd a chuireann i gcrích an traenáil mar Gharda Tarrthála atá le fáil ó Dearbhú Cáilíochta agus Cháilíochtaí Éireann

source: The Irish Water Safety course requires a minimum of 24 hours of lessons in resuscitation, water safety and life guarding to be completed
ga: Ní mór ar a laghad 24 uair an chloig ceachtanna in athbheochan, sábháilteacht uisce agus garda tarrthála do chúrsa an Chumainn Sábháilteachta Uisce

source: To get the award, candidates must then pass two physical examinations and a written examination
ga: Leis an dámhachtain a fháil bronnta orthu ní mór d'iarrthóirí dhá scrúdú fisiciúil a dhéanamh agus scrúdú scríofa

source: Irish Water Safety also has details of water safety courses currently running in each county on its website
ga: Tá eolas ar fáil freisin ag an gCumann Sábháilteacht Uisce ar chúrsaí sábháilteachta uisce atá ar fáil faoi láthair i ngach contae ar a shuíomh idirlín féin

source: Quality and Qualifications Ireland (QQI) is the national awards agency that certifies vocational courses run in local education centres around the country by local Education and Training Boards (ETB)
ga: Is í Dearbhú Cáilíochta agus Cháilíochtaí Éireann (DCCE) an t-údarás náisiúnta dámhachtainí a thugann teastais do chúrsaí gairmiúla atá dhá reachtáil in ionaid oideachais áitiúla ar fud na tíre faoi choimirce Boird Oideachais agus Oiliúna (ETB)

source: Through QQI, some local VECs offer foundation modules in Swimming and in Water Safety, but to be certified as a lifeguard, candidates must complete the Water Safety module and two further modules called Swimming and Water Safety (a level one module) and Lifeguarding (a level two module)
ga: Tríd DCCE, cuireann cuid de na CGO áitiúla bunchúrsaí Snámha agus Sábháilteachta Uisce ar fáil, ach le teastas mar Gharda Tarrthála a fháil ní mór d’iarrthóirí an cúrsa Sábháilteachta Uisce agus dhá chúrsa eile ar a dtugtar Snámh agus Sábháilteacht Uisce (cúrsa ag Leibhéal a 1) agus Garda Tarrthála (cúrsa ag Leibhéal a 2) a chur i gcrích

source: The third module is similar in content to the Irish Water Safety course
ga: Tá an tríú cúrsa cosúil ó thaobh ábhair de le cúrsa a ritheann an Cumann Sábháilteacht Uisce

source: Candidates for the Lifeguarding module must be competent swimmers and must have already completed the foundation module and the Level 1 module, be certified with the Irish Water Safety's Rescue 2 Award or have relevant life experience
ga: Ní mór d'iarrthóirí do chúrsa an Gharda Tarrthála a bheith ina snámhóirí maithe agus an bunchúrsa a bheith curtha i gcrích acu chomh maith leis an gcúrsa ag Leibhéal a 1, teastas Dámhachtain Tarrthála 2 a bheith acu ón gCumann Sábháilteacht Uisce nó taithí chuí saoil a bheith acu

source: Candidates are assessed by skills demonstration and a theoretical examination and are then given a pass, merit or distinction grade
ga: Déantar méasúnú ar na scileanna a thaispeánann na h-iarrthóirí agus tríd scrúdú teoiriciúil agus ansin baineann siad amach pas, grád fiúntais nó oirircis

source: Candidates who complete the Level 2 module receive a certificate and are also automatically awarded with certification as a lifeguard from Irish Water Safety
ga: Bronntar teastas ar iarrthóirí a chuireann an cúrsa ag Leibhéal a 2 i gcrích agus bronntar teastas mar Gharda Tarrthála orthu ón gCumann Sábháilteacht Uisce

source: There is no statutory provision for monitoring hygiene and water quality in private swimming pools
ga: Níl aon rialacha reachtúla leagtha síos le monatóireacht a dhéanamh ar shláinteachas agus ar cháilíocht uisce i linnte snámha príobháideacha

source: Ireland Active and An Taisce run a voluntary White Flag Award scheme that seeks to promote high quality leisure facilities, including swimming pools
ga: Tá scéim deonach, an Bhratach Bhán, dhá rith ag Éire Gníomhach agus ag An Taisce a dhéanann iarracht áiseanna áineasa d'ardchaighdeán a chur chun cinn, linnte snámha ina measc

source: The criteria for the award include quality of access, hygiene, safety, environmental policy, indoor and outdoor facilities, water quality and information and education
ga: Tá an duais seo bunaithe ar chaighdeán rochtana, sláinteachais agus sábháilteachta, ar pholasaí comhshaoil, áiseanna taobh istigh agus taobh amuigh, cáilíocht uisce chomh maith le eolas agus oideachas

source: Most public swimming pools and many private swimming pools offer courses in swimming for swimmers of all levels, ability and ages
ga: Cuireann formhór na linnte snámha poiblí agus go leor linnte snámha príobháideacha cúrsaí snámha ar fáil do snámhóirí ag gach leibhéal, cumas agus aois

source: For details of courses in your area, contact your local authority to find out where your nearest swimming pool is and what classes and courses are on offer
ga: Tá sonraí maidir leis na cúrsaí agus na ranganna atá ar fáil i do cheantar agus cá bhfuil an linn snámha áitiúil ar fáil ón údarás áitiúil

source: Grant funding for the construction or refurbishment of swimming pools is subject to a maximum award of 3.8 million euro and may not exceed 80 per cent of the total cost of the application
ga: Tá deontais ag uasráta de euro 3.8 milliún ar fáil le linnte snámha a thógáil nó le athchóiriú a dhéanamh orthu agus ní féidir ach uasmhéid de 80% de chostas iomlán an togra a fháil

source: In certain disadvantaged areas, funding of up to 90 per cent is available
ga: Tá suas le 90% den chostas le fáil do cheantair faoi leith faoi mhíbhuntáiste

source: The grants are available for building or updating a swimming pool, toddler pool, sauna and steam room
ga: Tá na deontais ar fáil le linn snámha, linn snámha do lapadáin, sauna agus seomra gaile a thógáil nó a athchóiriú

source: Public Authority Swimming Pool Programme
ga: Clár Linnte Snámha na nÚdarás Áitiúil

source: Applications under the Public Authority Swimming Pool Programme are made to the Department of Transport, Tourism and Sport by local authorities
ga: Is iad na húdaráis áitiúla go hiondúil a dhéanann iarratais faoi Chlár Linnte Snámha na nÚdarás Áitiúil chuig An Roinn Iompair, Turasóireachta agus Spóirt

source: Civil groups such as sports clubs can also apply for funding under the scheme
ga: Is féidir le grúpaí pobail cosúil le clubanna spóirt iarratais ar mhaoiniú faoin scéim seo a dhéanamh freisin

source: If a project to build a swimming pool is planned by an organisation other than a local authority, that organisation must first apply to its local authority for approval
ga: Má tá eagraíocht taobh amuigh den údarás áitiúil ag beartú ar linn snámha a thógáil ní mór dóibh ar dtús iarratas a chur faoi bhráid an údaráis áitiúil le cead a fháil

source: Before the local authority can support such a project, it must be satisfied that the balance of funding is available and that the project when completed will have a satisfactory level of access available to the general public
ga: Sula dtugann an t-údarás áitiúil tacaíocht don togra ní mór dó a bheith cinnte go mbeidh an comhaoiniú a theastaíonn ar fáil agus go mbeidh fáil sásúil ag an bpobal ginearálta ar an togra nuair atá an obair curtha i gcrích

source: There is no specific definition of what a satisfactory level of access is, but in practice, most local authorities would try to have a lower entrance fee than local private pools to facilitate greater public access
ga: Níl sé leagtha síos go sonrach céard atá i gceist le fáil sásúil, ach i ndáiríre, déanann formhór na n-údarás áitiúil iarracht an táille iontrála a bheith níos saoire acu ná mar atá ag linnte snámha príobháideacha le go mbeidh níos mó den phobal in ann freastal uirthi

source: The Department of Transport, Tourism and Sport gives approval to applications that comply with the Department's Procedures for the Planning, Approval and Financing of Swimming Pools and Technical Guidelines
ga: Tugann An Roinn Iompair, Turasóireachta agus Spóirt maoiniú do thograí a shásann Modh Oibre agus Treoracha Teicniúla na Roinne um Phleanáil, Ceadú agus Maoiniú Linnte Snámha

source: This means that the proposals for a pool must satisfy a number of conditions
ga: Mar sin ní mór do phleananna le linn snámha roinnt coinníollacha a shásamh

source: • The need for a swimming pool in the area
ga: • Riachtanas linne snámha sa cheantar

source: • The suitability of the site where the applicant authority wants to build the pool
ga: • Feiliúnacht an tsuímh ina bhfuil an t-údarás iarratasóra ag iarraidh na linne snámha a thógáil

source: • The future viability of the pool, in particular whether there will be enough money available to cover the pool's operation and maintenance costs
ga: • Inmharthanacht na linne snámha, go háirid an mbeidh dóthain airgid ar fáil leis na costais riaracháin agus cothabhála a bhaineann le linn snámha a íoc

source: • The construction and operating standards of the proposed project in comparison to existing facilities
ga: • Caighdeáin tógála agus oibrithe an togra atá i gceist i gcomparáid le háiseanna atá ann cheana

source: • The need to achieve an even spread of grant awards around the country
ga: • An gá atá ann cabhair deontais a thabhairt amach go cothrom ar fud na tíre

source: If an application is approved, the project will be completed in four stages. These stages are the Preliminary Report Stage, the Contract Document Stage, the Tender Stage and the Construction Stage
ga: Má cheadaítear iarratas cuirfear an togra i gcrích i gceithre chéim: an Chéim Réamhthuairisce, an Chéim Chonartha, an Chéim Tairisceana agus an Chéim Tógála

source: Technical advisors from the Office of Public Works (OPW) supervise each project and the OPW's approval is required before a pool project can proceed from one stage to the next
ga: Déanann comhairleoirí teicniúla ó Oifig na nOibreacha Poiblí maoirseacht ar gach togra agus ní mór cead na hoifige a bheith faighte sular féidir leis an togra dul ar aghaidh chuig an gcéad chéim eile

source: If you want to complain about the lack of a swimming pool in your area or about the standard or condition of swimming facilities in your area, you should first contact your local authority to find out who processes complaints in that local authority
ga: Más mian leat gearán a dhéanamh nach bhfuil linn snámha i do cheantar nó maidir le caighdeán nó riocht na n-áiseanna snámha i do cheantar, ba cheart duit ar dtús báire teagmháil a dhéanamh leis an údarás áitiúil le fáil amach cé a bhíonn ag breathnú i ndiaidh gearán don údarás áitiúil sin

source: Most local authorities have a complaints officer or customer care officer who deals with complaints
ga: Tá oifigeach gearán nó oifigeach cúraim chustaiméara ag na húdaráis áitiúla a bhíonn ag plé le gearáin

source: Within a few days of sending a letter, you will receive a notice in the post confirming that the local authority has received your complaint
ga: Taobh istigh de chúpla lá ón am a chuireann tú litir uait, gheobhaidh tú fógra scríofa ag deimhniú go bhfuil an gearán faighte ag an údarás áitiúil

source: A decision on your complaint will then be made within four weeks
ga: Déanfar cinneadh ar an ngearán taobh istigh de cheithre sheachtain

source: If you are not happy with the decision, you can write back to the local authority and request a review of your case
ga: Má tá tú míshásta leis an gcinneadh is féidir leat scríobh arís chuig an údarás áitiúil agus athbhreithniú a iarraidh ar do chás

source: If you are not happy with the outcome of this appeal, you can take your case to the Office of the Ombudsman, whose decision is final. Where to apply
ga: Má tá tú míshásta le toradh na hathbhreithnithe seo is féidir leat do chás a thabhairt chuig Oifig an Ombudsman

source: Local Authority Swimming Pool Programme
ga: Níl aon dul thar a c(h)inneadh
